import datetime

hour_oclock = {
    1:"час",
    2:"два",
    3:"три",
    4:"четыре",
    5:"пять",
    6:"шесть",
    7:"семь",
    8:"восемь",
    9:"девять",
    10:"десять",
    11:"одиннадцать",
    12:"двенадцать",
    13:"час",
    14:"два",
    15:"три" ,
    16:"четыре",
    17:"пять",
    18:"шесть",
    19:"семь",
    20:"восемь",
    21:"девять",
    22:"десять",
    23:"одиннадцать",
    24:"двенадцать",
}

hour_after = {
    1:"второго",
    2:"третьего",
    3:"четвертого",
    4:"пятого",
    5:"шестого",
    6:"седьмого",
    7:"восьмого",
    8:"девятого",
    9:"десятого",
    10:"одиннадцатого",
    11:"двенадцатого",
    12:"первого",
    13:"второго",
    14:"третьего",
    15:"четвертого", 
    16:"пятого",
    17:"шестого",
    18:"седьмого",
    19:"восьмого",
    20:"девятого",
    21:"десятого",
    22:"одиннадцатого",
    23:"двенадцатого",
    24:"первого",
}

minute_now ={
    1:"одна минута",
    2:"две минуты",
    3:"три минуты",
    4:"четыре минуты",
    5:"пять минут",
    6:"шесть минут",
    7:"семь минут",
    8:"восемь минут",
    9:"девять минут",
    10:"десять минут",
    11:"одиннадцать минут",
    12:"двенадцать минут",
    13:"тринадцать минут",
    14:"четырнадцать минут",
    15:"пятнадцать минут",
    16:"шестьнадцать минут",
    17:"семьнадцать минут",
    18:"восемнадцать минут",
    19:"девятнадцать минут",
    20:"двадцать минут",
    21:"двадцать одна минута",
    22:"двадцать две минуты",
    23:"двадцать три минуты",
    24:"двадцать четыре минуты",
    25:"двадцать пять минут",
    26:"двадцать шесть минут",
    27:"двадцать семь минут",
    28:"двадцать восемь минут",
    29:"двадцать девять минут",
    30:"половина",
    31:"тридцать одна минута",
    32:"тридцать две минуты",
    33:"тридцать три минуты",
    34:"тридцать четыре минуты",
    35:"тридцать пять минут",
    36:"тридцать шесть минут",
    37:"тридцать семь минут",
    38:"тридцать восемь минут",
    39:"тридцать девять минут",
    40:"сорок минут",
    41:"сорок одна минута",
    42:"сорок две минуты",
    43:"сорок три минуты",
    44:"сорок четыре минуты",
    45:"пятнадцати минут",
    46:"четырнадцати минут",
    47:"тринадцати минут",
    48:"двенадцати минут",
    49:"одиннадцати минут",
    50:"десяти минут",
    51:"девяти минут",
    52:"восьми минут",
    53:"семи минут",
    54:"шести минут",
    55:"пяти минут",
    56:"четырех минут",
    57:"трех минут",
    58:"двух минут",
    59:"одной минуты",
}

time_now = datetime.datetime.now()
time = time_now.strftime("%H %M").split()
hour, minute = int(time[0]), int(time[1])

def time_text(hour, minute):
    if minute == 0:
        h = hour_oclock[hour]
        print(f"ровно {h}")
    elif minute > 0 and minute < 30 or minute > 30 and minute < 45:
        h = hour_after[hour]
        m = minute_now[minute]
        print(f"{m} {h}")
    elif minute == 30:
        h = hour_after[hour]
        print(f"половина {h}")
    elif minute >= 45 and minute <= 59:
        h = hour_oclock[hour + 1]
        m = minute_now[minute]
        print(f"без {m} {h}")


pers_time = input("Введите время в формате ЧЧ:ММ\n")
pers_time = pers_time.split(":")
hp, mp = int(pers_time[0]), int(pers_time[1])

print("Текущее время:")
time_text(hour, minute)

print("Вы ввели время:")
time_text(hp, mp)

# input()